Autodesk.Revit.DB.IFCUserDefinedPropertyType
Since:
2027
An enumerated type listing user-defined property types
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertyType.Table
The property is a table value property.

Autodesk.Revit.DB.IFCUserDefinedPropertyType.List
The property is a list value property.

Autodesk.Revit.DB.IFCUserDefinedPropertyType.Bounded
The property is a bounded value property.

Autodesk.Revit.DB.IFCUserDefinedPropertyType.Single
The property is a single value property.